Revit 2027 API
BuiltInFailures.DimensionFailures.AngularDimensionRegenFailed Property
 Can't form Angular Dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AngularDimensionRegenFailed { get; }
Public Shared ReadOnly Property AngularDimensionRegenFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AngularDimensionRegenFailed {
	FailureDefinitionId^ get ();
}
static member AngularDimensionRegenFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace